# Parameter Type Id Analytical Model Height Param Property

Source: https://www.revitapidocs.com/2026/10e1f918-a90d-7df7-ae7b-c7e62c0dd3ae.htm

---

| Parameter Type Id Analytical Model Height Param Property |
| --- |

"Height"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId AnalyticalModelHeightParam { get; }
```

```
Public Shared ReadOnly Property AnalyticalModelHeightParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ AnalyticalModelHeightParam {
	ForgeTypeId^ get ();
}
```

```
static member AnalyticalModelHeightParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace